package ru.kpfu.itis.homework2

object AnimeRepository {
    val animeList = arrayListOf<Anime>(
        Anime(
            0,
            "Тетрадь смерти",
            "Главный герой аниме, Лайт Ягами, является лучшим школьником Японии и сыном полицейского. " +
                    "Однажды богу смерти по имени Рюк стало скучно, поэтому он решил бросить одну из своих тетрадей смерти в мир людей." +
                    " По дороге из школы Лайт находит лежащую на земле чёрную тетрадь и решает проверить её работоспособность.",
            "https://static.insales-cdn.com/images/products/1/4084/285364212/000.jpg"
        ),
        Anime(
            1, "Атака титанов",
            "Много лет назад в мире появились гигантские человекоподобные существа, которых окрестили титанами. Они опасны тем, что пожирают людей и несут разруху в города. " +
                    "Ища спасения, люди огородили себя тремя высокими стенами, выше, чем любой из монстров." +
                    "В один из солнечных дней главные герои — брат Эрен и сестра Микаса становятся свидетелями появления титана, что был даже выше стены.",
            "https://images.justwatch.com/poster/249390965/s592/vtorzhenie-titanov"
        ),
        Anime(
            2, "Код гиас", "Альтернативная реальность: Британская империя захватила треть мира." +
                    "В Японии, захваченной и переименованной в Зону 11, вместе с младшей сестрой живёт старшеклассник Лелуш – изгнанный сын Императора" +
                    "Неожиданно Лелуш оказывается вовлечён в столкновение между японскими террористами и британскими солдатами. Загадочная ведьма дарует ему сверхъестественную способность Гиас, позволяющую подчинять себе волю других людей.",
            "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/dfa64dee-6aa3-41c8-996d-54b7f05e40a8/300x450"
        ),
        Anime(
            3,
            "Блич",
            "Старшеклассник Итиго Куросаки видит другую сторону этого мира, в том числе и духов. Однажды он встречает девушку, которая умеет отправлять души умерших туда, где им положено быть. " +
                    "Случайно он получает её способности и начинает истреблять злых духов.",
            "https://papik.pro/uploads/posts/2021-10/1634584735_8-papik-pro-p-poster-blich-12.jpg"
        ),
        Anime(
            4,
            "Токийский гуль",
            "С обычным студентом Кэном Канэки случается беда, парень попадает в больницу. Но на этом неприятности не заканчиваются: ему пересаживают органы гулей – существ, " +
                    "поедающих плоть людей. После злосчастной операции Канэки становится одним из чудовищ, пытается стать своим, но для людей он теперь изгой, обреченный на уничтожение.",
            "https://resizer.mail.ru/p/86ba8d80-7f07-5f71-af07-c4342333ae04/AAAC12sYrJ1wQKwQHv6FCCNASh927PsKogl_f5TXO0oLKAdKfDoCN54FwaCp5J6gpujK6gTe2KXvJEjkmuBPobn89mM.jpg"
        )

    )
}